cask_args appdir: '/Applications'

tap 'homebrew/binary'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/tex'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'goles/battery'
tap 'thoughtbot/formulae'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']
brew 'youtube-dl'

# font tools
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'bramstein/webfonttools/woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp'
brew 'xpdf'
brew 'xz'

# other useful binaries.
brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'imagemagick', args: ['with-webp', 'with-rsvg']
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'
brew 'vbindiff'
brew 'webkit2png'
brew 'zopfli'

brew 'ag'
brew 'awscli'
brew 'bash'
brew 'battery'
brew 'catimg'
brew 'ctags'
brew 'docker'
brew 'ffmpeg'
brew 'flake8'
brew 'fzf'
brew 'gitsh'
brew 'gpg-agent'
brew 'heroku'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'hub'
brew 'iftop'
brew 'jrnl'
brew 'mecab'
brew 'mongodb'
brew 'mysql'
brew 'nkf'
brew 'peco'
brew 'phantomjs'
brew 'redis'
brew 'remarshal'
brew 'terraform'
brew 'tmux'
brew 'zsh'

cask '1password'
cask 'adium'
cask 'android-studio'
cask 'anki'
cask 'atom'
cask 'eclipse-jee'
cask 'firefox'
cask 'gitter'
cask 'google-chrome'
cask 'gyazo'
cask 'handbrake'
cask 'kindle'
cask 'ngrok'
cask 'obs'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'sizeup'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'unity'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
